Repository: yanheven/keystone
Catalog: keystone/locale/*/LC_MESSAGES/keystone-log-error.po
Languages: fr

source: Failed to construct notifier
fr: Échec de construction de la notification

source: Failed to send %(res_id)s %(event_type)s notification
fr: Échec de l'envoi de la notification %(res_id)s %(event_type)s

source: Failed to send %(action)s %(event_type)s notification
fr: Échec de l'envoi de la notification %(action)s %(event_type)s

source: Malformed endpoint - %(url)r is not a string
fr: Critère mal formé - %(url)r n'est pas une chaine de caractère

source: Malformed endpoint %(url)s - unknown key %(keyerror)s
fr: Noeud final incorrect %(url)s - clé inconnue %(keyerror)s

source: Malformed endpoint '%(url)s'. The following type error occurred during string substitution: %(typeerror)s
fr: Noeud final incorrect '%(url)s'. L'erreur suivante est survenue pendant la substitution de chaine : %(typeerror)s

source: Malformed endpoint %s - incomplete format (are you missing a type notifier ?)
fr: Noeud final incorrect '%s - Format incomplet (un type de notification manque-t-il ?)

source: Command %(to_exec)s exited with %(retcode)s- %(output)s
fr: La commande %(to_exec)s a retourné %(retcode)s- %(output)s

source: Failed to remove file %(file_path)r: %(error)s
fr: Échec de la suppression du fichier %(file_path)r: %(error)s

source: Error setting up the debug environment. Verify that the option --debug-url has the format <host>:<port> and that a debugger processes is listening on that port.
fr: Erreur de configuration de l'environnement de débogage. Vérifiez que l'option --debug-url a le format <host>:<port> et que le processus de débogage écoute sur ce port.

source: Could not bind to %(host)s:%(port)s
fr: Impossible de s'attacher à %(host)s:%(port)s

source: Server error
fr: Erreur serveur

source: Circular reference or a repeated entry found in region tree - %(region_id)s.
fr: Référence circulaire ou entrée dupliquée trouvée dans l'arbre de la région - %(region_id)s.

source: Error when signing assertion, reason: %(reason)s
fr: Erreur lors de la signature d'une assertion : %(reason)s

source: in fixed duration looping call
fr: dans l'appel en boucle de durée fixe

source: in dynamic looping call
fr: dans l'appel en boucle dynamique

source: Unhandled exception
fr: Exception non gérée

source: Failed to validate token
fr: Echec de validation du token

source: Unable to sign token
fr: Impossible de signer le jeton
